Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only.
guid: GUID of the shape whose metadata we are getting
ClientId: Client ID to identify the communication partners.
Returns: Returns 1 if successful, 0 otherwise.